#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.lambda_function.data.external.archive_prepare[0]: Reading...
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=ead5533e277a412d1154bb6650174a71aaee1c77]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=5a88f98173bc29f3ca2b2d72d93e951c5d2dea1c]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=4904720552765056910]
module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=929824910627622836]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=2513885956387966573]
module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0]: Refreshing state... [id=146004324528129346]
module.lambda_function.data.aws_caller_identity.current: Reading...
aws_iam_policy.cognito_pre_signup_policy: Refreshing state... [id=arn:aws:iam::522341695260:policy/Cognito_Pre_Signup_Policy]
module.lambda_layer_s3.data.aws_region.current: Reading...
module.lambda_function.data.aws_region.current: Reading...
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.lambda_function.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/Cognito_Unique_Email_Lambda_With_Layer]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_layer_s3.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:eu-west-2:522341695260:layer:node_modules_cognito:2]
module.lambda_function.data.aws_partition.current: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=Cognito_Unique_Email_Lambda_With_Layer]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 1s [id=522341695260]
module.lambda_function.data.aws_caller_identity.current: Read complete after 1s [id=522341695260]
module.lambda_function.aws_iam_role_policy_attachment.additional_one[0]: Refreshing state... [id=Cognito_Unique_Email_Lambda_With_Layer-20230517003744632900000002]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3947616484]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::522341695260:policy/Cognito_Unique_Email_Lambda_With_Layer-logs]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=Cognito_Unique_Email_Lambda_With_Layer-20230517003744587600000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=Cognito_Unique_Email_Lambda_With_Layer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "Cognito_Unique_Email_Lambda_With_Layer"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:522341695260:layer:node_modules_cognito:2",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:522341695260:function:Cognito_Unique_Email_Lambda_With_Layer:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:522341695260:function:Cognito_Unique_Email_Lambda_With_Layer:3/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4904720552765056910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1684284238717307000" -> "1684284478437123000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:eu-west-2:522341695260:layer:node_modules_cognito:2" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-17T00:37:54.166+0000" -> (known after apply)
      ~ filename                    = "builds/57eab14a4ae073940f215e88a744a8cf0acd55d79c5da2a2018c7dde9453238b.zip" -> "builds/d350d384601c76c3b413ec792d3d30fb9ef8e21608aa0955e8bfab5b7bd9f5c7.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:eu-west-2:522341695260:layer:node_modules_cognito:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-west-2:522341695260:layer:node_modules_cognito" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "gDywItwrYLSmUgwByy/Zkkfm5AkMppq1x1WcPiehuQ4=" -> (known after apply)
      ~ source_code_size            = 2334905 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./preSignupLambda/layer",
                      + null,
                    ],
                ]
              + filename      = "builds/d350d384601c76c3b413ec792d3d30fb9ef8e21608aa0955e8bfab5b7bd9f5c7.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d350d384601c76c3b413ec792d3d30fb9ef8e21608aa0955e8bfab5b7bd9f5c7.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2513885956387966573" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/57eab14a4ae073940f215e88a744a8cf0acd55d79c5da2a2018c7dde9453238b.zip" -> "builds/d350d384601c76c3b413ec792d3d30fb9ef8e21608aa0955e8bfab5b7bd9f5c7.zip"
          ~ "timestamp" = "1684283859242950000" -> "1684284478473835000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
      ~ id       = "146004324528129346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/57eab14a4ae073940f215e88a744a8cf0acd55d79c5da2a2018c7dde9453238b.zip" -> "builds/d350d384601c76c3b413ec792d3d30fb9ef8e21608aa0955e8bfab5b7bd9f5c7.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 5 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @juniorhamish, Action: `pull_request`*